app/Controllers/Api.php

SELECT *
FROM "tbl_jenis"
WHERE "tbl_jenis"."deleted_at" IS NULL
---
    public function index()
    {
        // return $this->respond($this->TblJenisModel->findAll());

        $datajenis = $this->TblJenisModel->findAll();