app/Controllers/Api.php

SELECT *
FROM "tbl_objek"
WHERE "tbl_objek"."deleted_at" IS NULL
---
    public function index()
    {
        // return $this->respond($this->TblObjekModel->findAll());

        $dataobjek = $this->TblObjekModel->findAll();