app/Controllers/Jenis.php

            'foto' => $nama_foto
        ];

        $this->TblJenisModel->save($data);
---
INSERT INTO "tbl_jenis" ("jenis", "deskripsi", "longitude", "latitude", "foto", "created_at", "updated_at") VALUES ('mangrove', '', '108.88875961303711', '-7.701635550163653', NULL, '2022-12-05 04:58:32', '2022-12-05 04:58:32')

    public function table()
    {

        $data['jenis'] = $this->TblJenisModel->findAll();
---
SELECT *
FROM "tbl_jenis"
WHERE "tbl_jenis"."deleted_at" IS NULL

    public function edit($id)
    {
        $data['jenis'] = $this->TblJenisModel->find($id);
---
SELECT *
FROM "tbl_jenis"
WHERE "tbl_jenis"."deleted_at" IS NULL
AND "tbl_jenis"."id" = '2'